In [1]:
import pandas as pd
import numpy as np
#from pandas import Series, DataFrame
obj = pd.Series([1,2,3,4])  # series是一维数组型对象，包含一个值序列，索引
obj

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
obj.values # 值

array([1, 2, 3, 4])

In [4]:
obj.index  # 索引

RangeIndex(start=0, stop=4, step=1)

In [5]:
# 更改索引
obj2 = pd.Series([4,3,2,1],index=['a','b','c','d'])
obj2

a    4
b    3
c    2
d    1
dtype: int64

In [6]:
# 使用标签进行检索
obj2['a']

4

In [7]:
obj2[['a','b','c']]  # 多个标签索引

a    4
b    3
c    2
dtype: int64

In [8]:
obj2[obj2>0]

a    4
b    3
c    2
d    1
dtype: int64

In [9]:
obj2 * 2

a    8
b    6
c    4
d    2
dtype: int64

In [12]:
np.exp(obj2)

a    54.598150
b    20.085537
c     7.389056
d     2.718282
dtype: float64

In [13]:
'b' in obj2

True

In [15]:
# 字典生成一个Series
sdata = {'oh': 350, 'te':32, 'uta':200}
obj3 = pd.Series(sdata)
obj3

oh     350
te      32
uta    200
dtype: int64

In [16]:
# 重新生成索引号, 索引标签与字典中的键不一至
state = {'ca', 'oh', 'te'}
obj4 = pd.Series(sdata, state)
obj4

te     32.0
ca      NaN
oh    350.0
dtype: float64

In [17]:
pd.isnull(obj4) # 值是否有NaN,缺失值

te    False
ca     True
oh    False
dtype: bool

pd.notnull(obj4)

## DataFrame

In [2]:
# 字典转 DataFrame 例子
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [3]:
frame.head()  # 取前5行

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [4]:
pd.DataFrame(data, columns=['year', 'state', 'pop']) # 改变列的顺序

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [5]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], # 增加了新的一列，但是会出现缺失值
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN